src/Catalogs/ЭтапыСделок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ЭтапыСделок</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидСделки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЭтапа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветЭтапа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ЭтапыСделок/Ext/ManagerModule.bsl
#Если Сервер Или ВнешнееСоединение Или ТолстыйКлиентОбычноеПриложение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

// Функция - Получить первоначальную структур этапов вида сделки
//
// Параметры:
//  ВидСделки	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьПервоначальнуюСтруктуруЭтаповВидаСделки(ВидСделки) Экспорт
	
	СтруктураЭтаповМассивом = Новый Массив;
	
	Если НЕ ЗначениеЗаполнено(ВидСделки) Тогда 
		Возврат СтруктураЭтаповМассивом;
	КонецЕсли;
	
	СтруктураВидаСделки = ОбщегоНазначенияСтоматология.ПолучитьЗначенияРеквизитов(ВидСделки, "Предопределенный, ТипСделки, ИмяПредопределенныхДанных");
	Если НЕ СтруктураВидаСделки.Предопределенный Тогда 
		Возврат СтруктураЭтаповМассивом;
	КонецЕсли;
	
	Если СтруктураВидаСделки.ИмяПредопределенныхДанных = "НовыеПациенты" Тогда 
		СтруктураЭтаповМассивом.Добавить(Новый Структура("НомерЭтапа, Наименование, ЦветЭтапа", 1, НСтр("ru = 'Потенциальный прием'; en = 'Potential reception'"), ПолучитьБазовыйЦветЭтапа(СтруктураВидаСделки.ИмяПредопределенныхДанных, 1)));
		СтруктураЭтаповМассивом.Добавить(Новый Структура("НомерЭтапа, Наименование, ЦветЭтапа", 2, НСтр("ru = 'Предложение озвучено'; en = 'The offer has been announced'"), ПолучитьБазовыйЦветЭтапа(СтруктураВидаСделки.ИмяПредопределенныхДанных, 2)));
		СтруктураЭтаповМассивом.Добавить(Новый Структура("НомерЭтапа, Наименование, ЦветЭтапа", 3, НСтр("ru = 'Пациент записан'; en = 'Patient signed up'"), ПолучитьБазовыйЦветЭтапа(СтруктураВидаСделки.ИмяПредопределенныхДанных, 3)));
		СтруктураЭтаповМассивом.Добавить(Новый Структура("НомерЭтапа, Наименование, ЦветЭтапа", 4, НСтр("ru = 'Пациент подтвердил'; en = 'Patient confirmed'"), ПолучитьБазовыйЦветЭтапа(СтруктураВидаСделки.ИмяПредопределенныхДанных, 4)));		
	ИначеЕсли СтруктураВидаСделки.ИмяПредопределенныхДанных = "ПостоянныеПациенты" Тогда
		СтруктураЭтаповМассивом.Добавить(Новый Структура("НомерЭтапа, Наименование, ЦветЭтапа", 1, НСтр("ru = 'Запись на первичный прием'; en = 'Appointment for the first appointment'"), ПолучитьБазовыйЦветЭтапа(СтруктураВидаСделки.ИмяПредопределенныхДанных, 1)));
		СтруктураЭтаповМассивом.Добавить(Новый Структура("НомерЭтапа, Наименование, ЦветЭтапа", 2, НСтр("ru = 'Первичный прием назначен'; en = 'The first appointment is scheduled'"), ПолучитьБазовыйЦветЭтапа(СтруктураВидаСделки.ИмяПредопределенныхДанных, 2)));
		СтруктураЭтаповМассивом.Добавить(Новый Структура("НомерЭтапа, Наименование, ЦветЭтапа", 3, НСтр("ru = 'Запись на повторный прием'; en = 'Re-appointment'"), ПолучитьБазовыйЦветЭтапа(СтруктураВидаСделки.ИмяПредопределенныхДанных, 3)));
		СтруктураЭтаповМассивом.Добавить(Новый Структура("НомерЭтапа, Наименование, ЦветЭтапа", 4, НСтр("ru = 'Повторный прием назначен'; en = 'Reappointment appointed'"), ПолучитьБазовыйЦветЭтапа(СтруктураВидаСделки.ИмяПредопределенныхДанных, 4)));		
	//ИначеЕсли СтруктураВидаСделки.ИмяПредопределенныхДанных = "КурсЛечения" Тогда
	//	СтруктураЭтаповМассивом.Добавить(Новый Структура("НомерЭтапа, Наименование, ЦветЭтапа", 1, НСтр("ru = 'Прием назначен'; en = 'Reception is appointed'"), ПолучитьБазовыйЦветЭтапа(СтруктураВидаСделки.ИмяПредопределенныхДанных, 1)));
	//	СтруктураЭтаповМассивом.Добавить(Новый Структура("НомерЭтапа, Наименование, ЦветЭтапа", 2, НСтр("ru = 'Прием не назначен'; en = 'No appointment'"), ПолучитьБазовыйЦветЭтапа(СтруктураВидаСделки.ИмяПредопределенныхДанных, 2)));
	КонецЕсли;
	
	Возврат СтруктураЭтаповМассивом;
	
КонецФункции

// Функция - Получить базовый цвет этапа
//
// Параметры:
//  ИмяПредопределенногоВидСделки	 - 	 - 
//  НомерЭтапа						 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьБазовыйЦветЭтапа(ИмяПредопределенногоВидСделки, НомерЭтапа) Экспорт
	
	ЦветСтрокой = "";
	Если НЕ ЗначениеЗаполнено(ИмяПредопределенногоВидСделки) ИЛИ НЕ ЗначениеЗаполнено(НомерЭтапа) Тогда 
		Возврат ЦветСтрокой;
	КонецЕсли;
	
	Если ИмяПредопределенногоВидСделки = "НовыеПациенты" Тогда
		Если НомерЭтапа = 1 Тогда 
			ЦветСтрокой = "{""#"",9cd510c7-abfc-11d4-9434-004095e12fc7,2,{3,0,{8388095}}}";
		ИначеЕсли НомерЭтапа = 2 Тогда 
			ЦветСтрокой = "{""#"",9cd510c7-abfc-11d4-9434-004095e12fc7,2,{3,0,{13158655}}}";
		ИначеЕсли НомерЭтапа = 3 Тогда 
			ЦветСтрокой = "{""#"",9cd510c7-abfc-11d4-9434-004095e12fc7,2,{3,0,{16769217}}}";	
		ИначеЕсли НомерЭтапа = 4 Тогда 
			ЦветСтрокой = "{""#"",9cd510c7-abfc-11d4-9434-004095e12fc7,2,{3,0,{12644999}}}";
		КонецЕсли;	
	ИначеЕсли ИмяПредопределенногоВидСделки = "ПостоянныеПациенты" Тогда
		Если НомерЭтапа = 1 Тогда 
			ЦветСтрокой = "{""#"",9cd510c7-abfc-11d4-9434-004095e12fc7,2,{3,0,{8388095}}}";
		ИначеЕсли НомерЭтапа = 2 Тогда 
			ЦветСтрокой = "{""#"",9cd510c7-abfc-11d4-9434-004095e12fc7,2,{3,0,{16769217}}}";
		ИначеЕсли НомерЭтапа = 3 Тогда 
			ЦветСтрокой = "{""#"",9cd510c7-abfc-11d4-9434-004095e12fc7,2,{3,0,{12644999}}}";
		КонецЕсли;	
	//ИначеЕсли ИмяПредопределенногоВидСделки = "КурсЛечения" Тогда
	//	Если НомерЭтапа = 1 Тогда 
	//		ЦветСтрокой = "{""#"",9cd510c7-abfc-11d4-9434-004095e12fc7,2,{3,0,{12644999}}}";
	//	ИначеЕсли НомерЭтапа = 2 Тогда 
	//		ЦветСтрокой = "{""#"",9cd510c7-abfc-11d4-9434-004095e12fc7,2,{3,0,{9605119}}}";
	//	КонецЕсли;	
	КонецЕсли;
	
	Возврат ЦветСтрокой;
	
КонецФункции

// Процедура - Обработка получения представления.
//
// Параметры:
//  Данные				 - 	 - 
//  Представление		 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если ПользователиСлужебныйПовтИсп.ЯзыкИнтерфейсаАнглийский() Тогда
		
		Если Данные.Ссылка = Справочники.ЭтапыСделок.Отказ Тогда
			Представление = "Refusal";
		ИначеЕсли Данные.Ссылка = Справочники.ЭтапыСделок.Успех Тогда
			Представление = "Success";	
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура, возвращает таблицу всех этапов сделок
//
Функция ПолучитьЭтапыСделок() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЭтапыСделок.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ЭтапыСделок КАК ЭтапыСделок
	|ГДЕ
	|	НЕ ЭтапыСделок.ПометкаУдаления
	|	И НЕ ЭтапыСделок.ВидСделки ЕСТЬ NULL";
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

// Функция - Получить этап по номеру
//
// Параметры:
//  ВидСделки	 - 	 - 
//  НомерЭтапа	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьЭтапПоНомеру(ВидСделки, НомерЭтапа) Экспорт
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидСделки"	, ВидСделки);
	Запрос.УстановитьПараметр("НомерЭтапа"	, НомерЭтапа);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЭтапыСделок.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ЭтапыСделок КАК ЭтапыСделок
	|ГДЕ
	|	ЭтапыСделок.ВидСделки = &ВидСделки
	|	И ЭтапыСделок.НомерЭтапа = &НомерЭтапа
	|	И НЕ ЭтапыСделок.ПометкаУдаления";
	
	ВыборкаЭтапа = Запрос.Выполнить().Выбрать();
	
	Возврат ?(ВыборкаЭтапа.Следующий(), ВыборкаЭтапа.Ссылка, Неопределено);	
	
КонецФункции

// Функция - Вернуть массив этапов вида сделки
//
// Параметры:
//  ВидСделки	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ВернутьМассивЭтаповВидаСделки(ВидСделки, ДобавлятьРезультирующиеЭтапы = Ложь, ТолькоДоступныеДляВыбора = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ЭтапыСделок.Ссылка КАК Этап
	               |ИЗ
	               |	Справочник.ЭтапыСделок КАК ЭтапыСделок
	               |ГДЕ
	               |	ЭтапыСделок.ПометкаУдаления = ЛОЖЬ
	               |	И ЭтапыСделок.ВидСделки = &ВидСделки
	               |	И ЭтапыСделок.Предопределенный = ЛОЖЬ
	               |	И ВЫБОР
	               |			КОГДА ЭтапыСделок.ВидСделки = &ПредопределеннайВидСделки
	               |					И &ТолькоДоступныеДляВыбора
	               |				ТОГДА ЭтапыСделок.НомерЭтапа < 3
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЭтапыСделок.НомерЭтапа";
	
	Запрос.УстановитьПараметр("ВидСделки"					, ВидСделки);
	Запрос.УстановитьПараметр("ТолькоДоступныеДляВыбора"	, ТолькоДоступныеДляВыбора);
	Запрос.УстановитьПараметр("ПредопределеннайВидСделки"	, ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыСделок.НовыеПациенты"));
	
	МассивЭтапов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Этап");
	
	Если ДобавлятьРезультирующиеЭтапы = Истина Тогда 
		МассивЭтапов.Добавить(Справочники.ЭтапыСделок.Успех);
		МассивЭтапов.Добавить(Справочники.ЭтапыСделок.Отказ);		
	КонецЕсли;
	
	Возврат МассивЭтапов;	
	
КонецФункции

#КонецОбласти
	
#КонецЕсли
